# FtPerKip Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..FtPerKip Property
SymbolTypeId Class See Also
---
Symbol ft/kip, indicating unit Feet per kip.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId FtPerKip { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FtPerKip As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FtPerKip {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace